import random
from operator import itemgetter, attrgetter
from tabulate import tabulate

table = [["старт", 0], ["Кинотеатр", 0], ["Казино", 0 ], ["Перемещение 1", 0], ["Ночной клуб", 0], 
["Благотворительный фонд", 0], ["Шоколадная фабрика",0], ["Хлебопекарня", 0], ["Шанс 1", 0], ["Пивоваренный завод", 0], 

["Налоговая инспекция", 0], ["Интернет-провайдер", 0], ["Пейджинговая компания", 0], ["Перемещение 2", 0], ["Оператор сотовой связи", 0], 
["Черный бизнес 2", 0], ["Обувная фабрика", 0], ["Мебельное производство", 0], ["Шанс 2", 0], ["Швейное объединение", 0], 

["Джекпот", 0], ["Издательский дом", 0], ["Перемещение 3", 0], ["Радиостанция", 0], ["Телевизионная компания", 0], 
["Белый бизнес", 0], ["Железнодорожное предприятие", 0], ["Шанс 3", 0], ["Морское пароходство", 0], ["Авиакомпания", 0], 

["Налоговая полиция", 0], ["Автомобильный завод", 0], ["Перемещение 4", 0], ["Судостроительная верфь", 0], ["Металлургический комбинат", 0], 
["Черный бизнес 4", 0], ["Угольный синдикат", 0], ["Шанс 4", 0], ["Газодобывающий концерн", 0], ["Нефтяной холдинг", 0]]

position = 0
for i in range(1000000):
    dices = random.randint(1,6) + random.randint(1,6)

    position = position + dices
    
    #"hopping" spaces
    if position == 15:
        table[position][1] += 1
        position = 5
    elif position == 30:
        table[position][1] += 1
        position = 10
    elif position == 35:
        table[position][1] += 1
        position = 5

    #loop 39+1 = 0
    if position > 39:
        position = position - 40
    
    #track each movement
    table[position][1] += 1
    print(f"Считаем, ход {i}.....", end='\r')

#remove unrelated spaces
table[0][1], table[3][1], table[5][1], table[8][1], table[10][1], table[13][1], table[15][1], table[18][1], table[20][1], table[22][1], table[25][1], table[27][1], table[30][1], table[32][1], table[35][1], table[37][1] = 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0

table = sorted(table, key=itemgetter(1), reverse=True)
print(tabulate(table, headers=["Название клетки","Количество попаданий"]))
